Autodesk.Revit.DB.FailureHandlingOptions.GetFailuresPreprocessor
Getting a callback to be invoked in the beginning of failure processing.
Returns:
The callback to be invoked in the beginning of failure processing.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetTransactionFinalizer
Getting a callback to be executed after transaction is completed.
Returns:
The callback to be executed after transaction is completed.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetDelayedMiniWarnings
Checks if showing of mini-warning dialog should be delayed
till the end of next transaction.
Returns:
True if showing of mini-warning dialog should be delayed
till the end of next transaction.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetClearAfterRollback
Checks if all posted failures should be removed silently when transaction is being rolled back.
Returns:
True if all posted failures should be removed silently when transaction is being rolled back.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.GetForcedModalHandling
Checks if error handling dialog at the end of transaction should be modal.
Returns:
True if error handling dialog at the end of transaction should be modal.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetFailuresPreprocessor(Autodesk.Revit.DB.IFailuresPreprocessor)
Setting a callback to be invoked in the beginning of failure processing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetTransactionFinalizer(Autodesk.Revit.DB.ITransactionFinalizer)
Setting a callback to be executed after transaction is completed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetDelayedMiniWarnings(System.Boolean)
Set the flag to delay showing of mini-warning dialog (if one is to be shown as a result of warnings in the current transaction)
till the end of next transaction.
Remarks:
This controls mini-warnings only; does not make sense in modal mode
setting it to true will postpone clearing mini-warning dialogs
until the next transaction is finished.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetClearAfterRollback(System.Boolean)
Set the flag to clear all posted failures silently if transaction is being rolled back intentionally and
delivering failures to the user is not desired.
Since:
2011

Autodesk.Revit.DB.FailureHandlingOptions.SetForcedModalHandling(System.Boolean)
Set the flag whether it pops modal error dialog if the transaction failed to finish.
Since:
2011